Статистика работы механизмов/Конфигурация/DataProcessors/_ВыгрузкаСообщенийОбОткрытииЗакрытииИИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_ВыгрузкаСообщенийОбОткрытииЗакрытииИИС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакПодписанта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СообщенияОбОткрытииЗакрытииИИС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выгружать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСообщения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВыводЦенныхБумаг</v8:Type>
								<v8:Type>cfg:DocumentRef.АнкетаФизическогоЛица</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.ВыводДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводЦенныхБумаг</v8:Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗакрытия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРегистрации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регистратор</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Статистика работы механизмов/Конфигурация/DataProcessors/_ВыгрузкаСообщенийОбОткрытииЗакрытииИИС/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Объект.Организация   = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	ЗаполнитьПериодПоУмолчанию(Объект.Период);
	
	Объект.ПризнакПодписанта = 1; //устанавливается только первый раз, потом форма запоминает значение
	
	ЗаполнитьВерсиюФормата();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьПериодПоУмолчанию(Период)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 3
		|	ДанныеКалендаря.Дата КАК Дата
		|ПОМЕСТИТЬ _КалендарьНаТриРабочихДня
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДанныеКалендаря.Дата < НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
		|	И ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МИНИМУМ(_КалендарьНаТриРабочихДня.Дата) КАК ДатаНачала,
		|	МАКСИМУМ(КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, -1), ДЕНЬ)) КАК ДатаОкончания
		|ИЗ
		|	_КалендарьНаТриРабочихДня КАК _КалендарьНаТриРабочихДня";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		ЗаполнитьЗначенияСвойств(Период, Выборка);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить три последних рабочих дня.");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВерсиюФормата()
	
	Элементы.ВерсияФормата.СписокВыбора.Добавить("5.01");
	Элементы.ВерсияФормата.СписокВыбора.Добавить("5.02");
	Элементы.ВерсияФормата.СписокВыбора.Добавить("5.03");
	Элементы.ВерсияФормата.СписокВыбора.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
	
	Объект.ВерсияФормата = Элементы.ВерсияФормата.СписокВыбора[0].Значение;

КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуСообщенийНаСервере(ИнтерактивныйЗапуск = Ложь)
	
#Область СтатистикаРаботыВнутреннихМеханизмовНачало
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(Объект, "Организация, Период, КаталогДанных");

	Механизм = РеквизитФормыВЗначение("Объект").Метаданные().ПолноеИмя() + ".ОбновитьТаблицуСообщенийНаСервере()";
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
#КонецОбласти
	
#Область ТекстЗапроса
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(ВТ_Сообщения.СчетДоверительногоУправления КАК Справочник.СчетаДоверительногоУправления) КАК СчетДоверительногоУправления,
		|	ВТ_Сообщения.ВидСообщения КАК ВидСообщения,
		|	ВТ_Сообщения.Документ КАК Документ,
		|	ВТ_Сообщения.Номер КАК Номер,
		|	ВТ_Сообщения.Выгружать КАК Выгружать
		|ПОМЕСТИТЬ СообщенияОбОткрытииЗакрытииИИС
		|ИЗ
		|	&СообщенияОбОткрытииЗакрытииИИС КАК ВТ_Сообщения
		|ГДЕ
		|	НЕ &ИнтерактивныйЗапуск
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВводДенежныхСредств.Дата КАК Дата,
		|	ВводДенежныхСредств.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВводДенежныхСредств.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Вводы
		|ИЗ
		|	Документ.ВводДенежныхСредств КАК ВводДенежныхСредств
		|ГДЕ
		|	ВводДенежныхСредств.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет)
		|	И ВводДенежныхСредств.Проведен
		|	И ВводДенежныхСредств.Организация = &Организация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВводЦенныхБумаг.Дата,
		|	ВводЦенныхБумаг.СчетДоверительногоУправления,
		|	ВводЦенныхБумаг.Ссылка
		|ИЗ
		|	Документ.ВводЦенныхБумаг КАК ВводЦенныхБумаг
		|ГДЕ
		|	ВводЦенныхБумаг.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет)
		|	И ВводЦенныхБумаг.Проведен
		|	И ВводЦенныхБумаг.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВыводДенежныхСредств.Дата КАК Дата,
		|	ВыводДенежныхСредств.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВыводДенежныхСредств.Ссылка КАК Ссылка,
		|	ВыводДенежныхСредств.Основание КАК Основание
		|ПОМЕСТИТЬ ВТ_Выводы
		|ИЗ
		|	Документ.ВыводДенежныхСредств КАК ВыводДенежныхСредств
		|ГДЕ
		|	ВыводДенежныхСредств.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет)
		|	И ВыводДенежныхСредств.Проведен
		|	И ВыводДенежныхСредств.Организация = &Организация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВыводЦенныхБумаг.Дата,
		|	ВыводЦенныхБумаг.СчетДоверительногоУправления,
		|	ВыводЦенныхБумаг.Ссылка,
		|	ВыводЦенныхБумаг.Поручение
		|ИЗ
		|	Документ.ВыводЦенныхБумаг КАК ВыводЦенныхБумаг
		|ГДЕ
		|	ВыводЦенныхБумаг.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет)
		|	И ВыводЦенныхБумаг.Проведен
		|	И ВыводЦенныхБумаг.Организация = &Организация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АнкетаФизическогоЛица.Дата,
		|	КлиентыДоверительногоУправления.СчетДоверительногоУправления,
		|	АнкетаФизическогоЛица.Ссылка,
		|	NULL
		|ИЗ
		|	(ВЫБРАТЬ
		|		АнкетаФизическогоЛица.Организация КАК Организация,
		|		АнкетаФизическогоЛица.Ссылка КАК Ссылка,
		|		АнкетаФизическогоЛица.ЮрФизЛицо КАК ЮрФизЛицо,
		|		АнкетаФизическогоЛица.Дата КАК Дата,
		|		МАКСИМУМ(КлиентыДоверительногоУправления.Период) КАК ПериодКлиентаДУ
		|	ИЗ
		|		Документ.АнкетаФизическогоЛица КАК АнкетаФизическогоЛица
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления КАК КлиентыДоверительногоУправления
		|			ПО АнкетаФизическогоЛица.Организация = КлиентыДоверительногоУправления.Организация
		|				И АнкетаФизическогоЛица.ЮрФизЛицо = КлиентыДоверительногоУправления.Клиент
		|				И АнкетаФизическогоЛица.Дата >= КлиентыДоверительногоУправления.Период
		|				И (КлиентыДоверительногоУправления.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет))
		|	ГДЕ
		|		АнкетаФизическогоЛица.Проведен
		|		И АнкетаФизическогоЛица.Организация = &Организация
		|		И НЕ АнкетаФизическогоЛица.ДатаСмерти = ДАТАВРЕМЯ(1, 1, 1)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		АнкетаФизическогоЛица.Ссылка,
		|		АнкетаФизическогоЛица.ЮрФизЛицо,
		|		АнкетаФизическогоЛица.Дата,
		|		АнкетаФизическогоЛица.Организация) КАК АнкетаФизическогоЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления КАК КлиентыДоверительногоУправления
		|		ПО АнкетаФизическогоЛица.Организация = КлиентыДоверительногоУправления.Организация
		|			И АнкетаФизическогоЛица.ЮрФизЛицо = КлиентыДоверительногоУправления.Клиент
		|			И АнкетаФизическогоЛица.ПериодКлиентаДУ = КлиентыДоверительногоУправления.Период
		|			И (КлиентыДоверительногоУправления.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_Вводы.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВТ_Вводы.Дата КАК Дата,
		|	МИНИМУМ(ВТ_Вводы.Ссылка) КАК Ссылка,
		|	NULL КАК Основание
		|ПОМЕСТИТЬ ВТ_ПервыеВводыВыводы
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ_Вводы.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		МИНИМУМ(ВТ_Вводы.Дата) КАК Дата
		|	ИЗ
		|		ВТ_Вводы КАК ВТ_Вводы
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТ_Вводы.СчетДоверительногоУправления) КАК ДатыПервыхВводов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Вводы КАК ВТ_Вводы
		|		ПО ДатыПервыхВводов.СчетДоверительногоУправления = ВТ_Вводы.СчетДоверительногоУправления
		|			И ДатыПервыхВводов.Дата = ВТ_Вводы.Дата
		|ГДЕ
		|	ДатыПервыхВводов.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Вводы.СчетДоверительногоУправления,
		|	ВТ_Вводы.Дата
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Выводы.СчетДоверительногоУправления,
		|	ВТ_Выводы.Дата,
		|	МИНИМУМ(ВТ_Выводы.Ссылка),
		|	МИНИМУМ(ВТ_Выводы.Основание)
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ_Выводы.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		МИНИМУМ(ВТ_Выводы.Дата) КАК Дата
		|	ИЗ
		|		ВТ_Выводы КАК ВТ_Выводы
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТ_Выводы.СчетДоверительногоУправления) КАК ДатаПервыхВыводов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Выводы КАК ВТ_Выводы
		|		ПО ДатаПервыхВыводов.СчетДоверительногоУправления = ВТ_Выводы.СчетДоверительногоУправления
		|			И ДатаПервыхВыводов.Дата = ВТ_Выводы.Дата
		|ГДЕ
		|	ДатаПервыхВыводов.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Выводы.СчетДоверительногоУправления,
		|	ВТ_Выводы.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ПервыеВводыВыводы.Ссылка) В (ТИП(Документ.ВыводДенежныхСредств), ТИП(Документ.ВыводЦенныхБумаг), ТИП(Документ.АнкетаФизическогоЛица))
		|			ТОГДА ВТ_ПервыеВводыВыводы.Дата
		|		ИНАЧЕ &НачалоПериода
		|	КОНЕЦ МЕЖДУ &НачалоПериода И &КонецПериода
		|		И ЕСТЬNULL(СообщенияОбОткрытииЗакрытииИИС.Выгружать, НомераОбъектов.Номер ЕСТЬ NULL) КАК Выгружать,
		|	ВТ_ПервыеВводыВыводы.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ПервыеВводыВыводы.Ссылка) В (ТИП(Документ.ВводДенежныхСредств), ТИП(Документ.ВводЦенныхБумаг))
		|			ТОГДА 1
		|		КОГДА НЕ ПоручениеНаВыводАктивовНаДругойИИС.Ссылка ЕСТЬ NULL
		|			ТОГДА 4
		|		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ПервыеВводыВыводы.Ссылка) В (ТИП(Документ.ВыводДенежныхСредств), ТИП(Документ.ВыводЦенныхБумаг), ТИП(Документ.АнкетаФизическогоЛица))
		|			ТОГДА 3
		|	КОНЕЦ КАК ВидСообщения,
		|	ВЫБОР
		|		КОГДА НЕ ПоручениеНаВыводАктивовНаДругойИИС.Ссылка ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА ТИПЗНАЧЕНИЯ(ВТ_ПервыеВводыВыводы.Ссылка) = ТИП(Документ.ВыводДенежныхСредств)
		|						ТОГДА ВЫРАЗИТЬ(ВТ_ПервыеВводыВыводы.Ссылка КАК Документ.ВыводДенежныхСредств).Контрагент
		|					КОГДА ТИПЗНАЧЕНИЯ(ВТ_ПервыеВводыВыводы.Ссылка) = ТИП(Документ.ВыводЦенныхБумаг)
		|						ТОГДА ВЫРАЗИТЬ(ВТ_ПервыеВводыВыводы.Ссылка КАК Документ.ВыводЦенныхБумаг).Контрагент
		|				КОНЕЦ
		|	КОНЕЦ КАК СтороннийКонтрагент,
		|	ВТ_ПервыеВводыВыводы.Ссылка КАК Документ,
		|	НомераОбъектов.Номер КАК Номер,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ПервыеВводыВыводы.Ссылка) В (ТИП(Документ.ВыводДенежныхСредств), ТИП(Документ.ВыводЦенныхБумаг))
		|			ТОГДА ВТ_ПервыеВводыВыводы.СчетДоверительногоУправления.ДатаРасторжения
		|		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ПервыеВводыВыводы.Ссылка) = ТИП(Документ.АнкетаФизическогоЛица)
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ПервыеВводыВыводы.Ссылка КАК Документ.АнкетаФизическогоЛица).Дата
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ДатаЗакрытия,
		|	НомераОбъектов.Ответственный КАК Ответственный,
		|	НомераОбъектов.ДатаРегистрации КАК ДатаРегистрации,
		|	ВТ_ПервыеВводыВыводы.Ссылка <> ЕСТЬNULL(НомераОбъектов.Объект, ВТ_ПервыеВводыВыводы.Ссылка) КАК Предупреждение,
		|	ЕСТЬNULL(НомераОбъектов.Объект, ВТ_ПервыеВводыВыводы.Ссылка) КАК Регистратор,
		|	ВТ_ПервыеВводыВыводы.Дата КАК ДатаРегистратора
		|ИЗ
		|	ВТ_ПервыеВводыВыводы КАК ВТ_ПервыеВводыВыводы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НомераОбъектов КАК НомераОбъектов
		|		ПО (НомераОбъектов.Организация = &Организация)
		|			И (НомераОбъектов.ВидНумерации = ЗНАЧЕНИЕ(Справочник.ВидыНумерацииОбъектов.СообщенияОбОткрытииЗакрытииИИС))
		|			И ВТ_ПервыеВводыВыводы.СчетДоверительногоУправления = НомераОбъектов.СчетДоверительногоУправления
		|			И (ВЫБОР
		|				КОГДА ТИПЗНАЧЕНИЯ(ВТ_ПервыеВводыВыводы.Ссылка) В (ТИП(Документ.ВводДенежныхСредств), ТИП(Документ.ВводЦенныхБумаг))
		|					ТОГДА ТИПЗНАЧЕНИЯ(НомераОбъектов.Объект) В (ТИП(Документ.ВводДенежныхСредств), ТИП(Документ.ВводЦенныхБумаг))
		|				КОГДА ТИПЗНАЧЕНИЯ(ВТ_ПервыеВводыВыводы.Ссылка) В (ТИП(Документ.ВыводДенежныхСредств), ТИП(Документ.ВыводЦенныхБумаг), ТИП(Документ.АнкетаФизическогоЛица))
		|					ТОГДА ТИПЗНАЧЕНИЯ(НомераОбъектов.Объект) В (ТИП(Документ.ВыводДенежныхСредств), ТИП(Документ.ВыводЦенныхБумаг), ТИП(Документ.АнкетаФизическогоЛица))
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ СообщенияОбОткрытииЗакрытииИИС КАК СообщенияОбОткрытииЗакрытииИИС
		|		ПО (СообщенияОбОткрытииЗакрытииИИС.Документ = ВТ_ПервыеВводыВыводы.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоручениеНаДвижениеДенежныхСредств КАК ПоручениеНаВыводАктивовНаДругойИИС
		|		ПО (ТИПЗНАЧЕНИЯ(ВТ_ПервыеВводыВыводы.Ссылка) В (ТИП(Документ.ВыводДенежныхСредств), ТИП(Документ.ВыводЦенныхБумаг)))
		|			И ((ВЫРАЗИТЬ(ВТ_ПервыеВводыВыводы.Основание КАК Документ.ПоручениеНаДвижениеДенежныхСредств)) = ПоручениеНаВыводАктивовНаДругойИИС.Ссылка)
		|			И (ПоручениеНаВыводАктивовНаДругойИИС.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВыводДенежныхСредствСПереводомВсехАктивовНаДругойИИС))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номер,
		|	Документ";
#КонецОбласти
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("НачалоПериода", Объект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Объект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ИнтерактивныйЗапуск", ИнтерактивныйЗапуск);
	Запрос.УстановитьПараметр("СообщенияОбОткрытииЗакрытииИИС", Объект.СообщенияОбОткрытииЗакрытииИИС.Выгрузить());
	
	Объект.СообщенияОбОткрытииЗакрытииИИС.Очистить();
	Объект.СообщенияОбОткрытииЗакрытииИИС.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Открыто = 0;
	Закрыто = 0;
	
	Для Каждого ТекСтрока Из Объект.СообщенияОбОткрытииЗакрытииИИС Цикл
		Если ТекСтрока.ВидСообщения < 3 Тогда
			Открыто = Открыто + 1;
		ИначеЕсли ТекСтрока.ВидСообщения > 2 Тогда
			Закрыто = Закрыто + 1;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.СообщенияОбОткрытииЗакрытииИИСВидСообщения.ТекстПодвала = "Открыто " + Формат(Открыто, "ЧДЦ=0; ЧГ=0") + " / Закрыто " + Формат(Закрыто, "ЧДЦ=0; ЧГ=0");
	
#Область СтатистикаРаботыВнутреннихМеханизмовЗавершение
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
#КонецОбласти
	
КонецПроцедуры

&НаСервере
Процедура ЗарегистрироватьНомераСообщенийНаСервере()
	
#Область СтатистикаРаботыВнутреннихМеханизмовНачало
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(Объект, "Организация, Период, КаталогДанных");

	Механизм = РеквизитФормыВЗначение("Объект").Метаданные().ПолноеИмя() + ".ЗарегистрироватьНомераСообщенийНаСервере()";
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
#КонецОбласти

	МассивОбъектов = Новый Массив;
	Для Каждого СтрокаСообщений Из Объект.СообщенияОбОткрытииЗакрытииИИС Цикл
		Если СтрокаСообщений.Выгружать Тогда
			МассивОбъектов.Добавить(СтрокаСообщений.Регистратор);
		КонецЕсли;
	КонецЦикла;

	РегистрыСведений.НомераОбъектов.ЗарегистрироватьНовыйНомер(Объект.Организация, 
																Справочники.ВидыНумерацииОбъектов.СообщенияОбОткрытииЗакрытииИИС, 
																МассивОбъектов);
																
#Область СтатистикаРаботыВнутреннихМеханизмовЗавершение
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
#КонецОбласти
																
	ОбновитьТаблицуСообщенийНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСообщенияXML()
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
#Область ТекстЗапроса
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(ВТ_Сообщения.СчетДоверительногоУправления КАК Справочник.СчетаДоверительногоУправления) КАК СчетДоверительногоУправления,
		|	ВТ_Сообщения.ВидСообщения КАК ВидСообщения,
		|	ВТ_Сообщения.Регистратор КАК Регистратор,
		|	ВТ_Сообщения.ДатаРегистратора КАК ДатаРегистратора,
		|	ВТ_Сообщения.Номер КАК Номер,
		|	ВТ_Сообщения.СтороннийКонтрагент КАК СтороннийКонтрагент,
		|	ВТ_Сообщения.ДатаЗакрытия КАК ДатаЗакрытия
		|ПОМЕСТИТЬ _СообщенияОбОткрытииЗакрытииИИС
		|ИЗ
		|	&СообщенияОбОткрытииЗакрытииИИС КАК ВТ_Сообщения
		|ГДЕ
		|	ВТ_Сообщения.Выгружать
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВводыВыводыАктивовВВалютеУчетаОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВводыВыводыАктивовВВалютеУчетаОбороты.Период КАК Год,
		|	ВводыВыводыАктивовВВалютеУчетаОбороты.БалансоваяСтоимостьОборот КАК Сумма
		|ПОМЕСТИТЬ _ВводыПоГодам
		|ИЗ
		|	РегистрНакопления.ВводыВыводыАктивовВВалютеУчета.Обороты(
		|			,
		|			,
		|			Год,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						ВТ_Сообщения.СчетДоверительногоУправления
		|					ИЗ
		|						_СообщенияОбОткрытииЗакрытииИИС КАК ВТ_Сообщения
		|					ГДЕ
		|						ВТ_Сообщения.ВидСообщения В (3, 4))
		|				И НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)) КАК ВводыВыводыАктивовВВалютеУчетаОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_Сообщения.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВТ_Сообщения.СчетДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключения, 
		|	ВЫБОР
		|		КОГДА ВТ_Сообщения.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ ВТ_Сообщения.ДатаЗакрытия = НЕОПРЕДЕЛЕНО
		|			ТОГДА &Период
		|		ИНАЧЕ ВТ_Сообщения.ДатаЗакрытия
		|	КОНЕЦ КАК ДатаЗакрытия,
		|	ВЫБОР
		|		КОГДА РеквизитыЮридическихЛицСрезПоследних.КПП2 = """"
		|			ТОГДА ""ON_INSCHET_"" + ПОДСТРОКА(РеквизитыЮридическихЛицСрезПоследних.КПП, 1, 4) + ""_"" + ПОДСТРОКА(РеквизитыЮридическихЛицСрезПоследних.КПП, 1, 4) + ""_"" + РеквизитыЮридическихЛицСрезПоследних.ИНН + РеквизитыЮридическихЛицСрезПоследних.КПП + ""_"" + &ПериодСтрокой
		|		ИНАЧЕ ""ON_INSCHET_"" + ПОДСТРОКА(РеквизитыЮридическихЛицСрезПоследних.КПП, 1, 4) + ""_"" + ПОДСТРОКА(РеквизитыЮридическихЛицСрезПоследних.КПП2, 1, 4) + ""_"" + РеквизитыЮридическихЛицСрезПоследних.ИНН + РеквизитыЮридическихЛицСрезПоследних.КПП2 + ""_"" + &ПериодСтрокой
		|	КОНЕЦ КАК ИдентификаторФайла,
		|	""1"" КАК ВерсияПрограммы,
		|	&ВерсияФормата КАК ВерсияФормата,
		|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК НаименованиеОрганизации,
		|	РеквизитыЮридическихЛицСрезПоследних.ИНН КАК ИННОрганизации,
		|	ВЫБОР
		|		КОГДА РеквизитыЮридическихЛицСрезПоследних.КПП2 = """"
		|			ТОГДА РеквизитыЮридическихЛицСрезПоследних.КПП
		|		ИНАЧЕ РеквизитыЮридическихЛицСрезПоследних.КПП2
		|	КОНЕЦ КАК КППОрганизации,
		|	КонтактнаяИнформацияОрганизации.Представление КАК ТелефонОрганизации,
		|	"""" КАК ФамилияПодписанта,
		|	"""" КАК ИмяПодписанта,
		|	"""" КАК ОтчествоПодписанта,
		|	""1114605"" КАК КНД,
		|	&Период КАК ДатаФормирования,
		|	ВТ_Сообщения.Номер КАК НомерСообщения,
		|	ВЫБОР
		|		КОГДА РеквизитыЮридическихЛицСрезПоследних.КПП2 = """"
		|			ТОГДА ПОДСТРОКА(РеквизитыЮридическихЛицСрезПоследних.КПП, 1, 4)
		|		ИНАЧЕ ПОДСТРОКА(РеквизитыЮридическихЛицСрезПоследних.КПП2, 1, 4)
		|	КОНЕЦ КАК КодНалоговогоОргана,
		|	""0"" КАК НомерКорректировки,
		|	ВТ_Сообщения.ВидСообщения КАК ВидСообщения,
		|	ВТ_Сообщения.СчетДоверительногоУправления.НомерДоговора КАК НомерДоговораИИС,
		|	ВТ_Сообщения.ДатаРегистратора КАК ДатаИИС,
		|	ВЫБОР
		|		КОГДА &ВерсияФормата >= ""5.02""
		|				И ВТ_Сообщения.ВидСообщения >= 3
		|			ТОГДА ВТ_Сообщения.ДатаРегистратора
		|		ИНАЧЕ ВТ_Сообщения.СчетДоверительногоУправления.ДатаЗаключения
		|	КОНЕЦ КАК ДатаДоговораИИС,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ИНН КАК ИННВладельцаИИС,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.МестоРождения КАК МестоРожденияВладельцаИИС,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ДатаРождения КАК ДатаРожденияВладельцаИИС,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Фамилия КАК ФамилияВладельцаИИС,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Имя КАК ИмяВладельцаИИС,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Отчество КАК ОтчествоВладельцаИИС,
		|	КодыВоВнешнихСистемахСрезПоследних.Код КАК КодВидаДокументаВладельцаИИС,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.СерияУдостоверенияЛичности + РеквизитыФизическихЛицАнкетныеСрезПоследних.НомерУдостоверенияЛичности КАК СерияНомерДокументаВладельцаИИС,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ДатаВыдачиУдостоверенияЛичности КАК ДатаДокументаВладельцаИИС,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ОрганВыдавшийУдостоверениеЛичности КАК ОрганВыдавшийДокументВладельцаИИС,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.АдресРегистрацииФИАС КАК АдресРегистрацииФИАС,
		|	РеквизитыСтороннихКонтрагентовСрезПоследних.ПолноеНаименованиеПоУставу КАК НаименованиеСтороннегоКонтрагента,
		|	РеквизитыСтороннихКонтрагентовСрезПоследних.ИНН КАК ИННСтороннегоКонтрагента,
		|	РеквизитыСтороннихКонтрагентовСрезПоследних.КПП КАК КППСтороннегоКонтрагента
		|ИЗ
		|	_СообщенияОбОткрытииЗакрытииИИС КАК ВТ_Сообщения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				ЮрФизЛицо = &ОрганизацияЮрЛицо
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО ВТ_Сообщения.СчетДоверительногоУправления.Организация.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация.СрезПоследних(
		|				&Период,
		|				Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.Телефон)
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК КонтактнаяИнформацияОрганизации
		|		ПО ВТ_Сообщения.СчетДоверительногоУправления.Организация.ЮрФизЛицо = КонтактнаяИнформацияОрганизации.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				ЮрФизЛицо В
		|						(ВЫБРАТЬ
		|							_ВТ.СтороннийКонтрагент
		|						ИЗ
		|							_СообщенияОбОткрытииЗакрытииИИС КАК _ВТ
		|						ГДЕ
		|							НЕ _ВТ.СтороннийКонтрагент ЕСТЬ NULL)
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыСтороннихКонтрагентовСрезПоследних
		|		ПО (ВТ_Сообщения.СтороннийКонтрагент = РеквизитыСтороннихКонтрагентовСрезПоследних.ЮрФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, ) КАК КлиентыДоверительногоУправленияСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|					&Период,
		|					Организация = &Организация
		|						И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|						&Период,
		|						ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ЦБРФ)
		|							И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.УказаниеЦБ3484У)) КАК КодыВоВнешнихСистемахСрезПоследних
		|				ПО РеквизитыФизическихЛицАнкетныеСрезПоследних.ВидУдостоверенияЛичности = КодыВоВнешнихСистемахСрезПоследних.Объект
		|			ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
		|		ПО ВТ_Сообщения.СчетДоверительногоУправления = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления";
#КонецОбласти

	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ОрганизацияЮрЛицо", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "ЮрФизЛицо"));
	Запрос.УстановитьПараметр("Период", Объект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ПериодСтрокой", Формат(Объект.Период.ДатаОкончания, "ДФ=yyyyMMdd"));
	Запрос.УстановитьПараметр("СообщенияОбОткрытииЗакрытииИИС", Объект.СообщенияОбОткрытииЗакрытииИИС.Выгрузить());
	Запрос.УстановитьПараметр("ВерсияФормата", Объект.ВерсияФормата);
	
	СообщенияXML = Новый Структура;
	
	Результат = Запрос.Выполнить();

	ВводыПоГодам = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ВводыПоГодам").ПолучитьДанные().Выгрузить();
	
	Выборка = Результат.Выбрать(); 
	
	Если Объект.ВерсияФормата = "5.03" Тогда

		Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Схема_xsd_v_03_01"); 
				
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xsd");
		Макет.Записать(ИмяВременногоФайла);
		
		СвояФабрикаXDTO = СоздатьФабрикуXDTO(ИмяВременногоФайла);
		
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
		
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.ОткрытьФайл(ИмяВременногоФайла, "WINDOWS-1251");
		ЗаписьXML.ЗаписатьОбъявлениеXML();
		
		Если Объект.ВерсияФормата = "5.01" Тогда
			
#Область ВерсияФормата_5_01
			ЗаписьXML.ЗаписатьНачалоЭлемента("Файл");
			ЗаписатьАтрибут(ЗаписьXML, "ИдФайл", Выборка.ИдентификаторФайла + "_" + Выборка.НомерСообщения);
			ЗаписатьАтрибут(ЗаписьXML, "ВерсПрог", Выборка.ВерсияПрограммы);
			ЗаписатьАтрибут(ЗаписьXML, "ВерсФорм", Выборка.ВерсияФормата);
			
				ЗаписьXML.ЗаписатьНачалоЭлемента("СвОтпр");
					ЗаписьXML.ЗаписатьНачалоЭлемента("ОтпрЮЛ");
					ЗаписатьАтрибут(ЗаписьXML, "НаимОрг", Выборка.НаименованиеОрганизации);
					ЗаписатьАтрибут(ЗаписьXML, "ИННЮЛ", Выборка.ИННОрганизации);
					ЗаписатьАтрибут(ЗаписьXML, "КПП", Выборка.КППОрганизации);
					ЗаписьXML.ЗаписатьКонецЭлемента();
				ЗаписьXML.ЗаписатьКонецЭлемента();
			
				ЗаписьXML.ЗаписатьНачалоЭлемента("Подписант");
				ЗаписатьАтрибут(ЗаписьXML, "ПрПодп", Строка(Объект.ПризнакПодписанта));
				
					ЗаписьXML.ЗаписатьНачалоЭлемента("ФИО");
					ЗаписатьАтрибут(ЗаписьXML, "Фамилия", Выборка.ФамилияПодписанта);
					ЗаписатьАтрибут(ЗаписьXML, "Имя", Выборка.ИмяПодписанта);
					ЗаписатьАтрибут(ЗаписьXML, "Отчество", Выборка.ОтчествоПодписанта);
					ЗаписьXML.ЗаписатьКонецЭлемента();
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("СвПред");
					ЗаписатьАтрибут(ЗаписьXML, "НаимДок", "-");
					ЗаписьXML.ЗаписатьКонецЭлемента();	
				
				ЗаписьXML.ЗаписатьКонецЭлемента();
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("Документ");
				ЗаписатьАтрибут(ЗаписьXML, "КНД", Выборка.КНД);
				ЗаписатьАтрибут(ЗаписьXML, "ДатаДок", Выборка.ДатаФормирования);
				ЗаписатьАтрибут(ЗаписьXML, "НомерСооб", Выборка.НомерСообщения);
				ЗаписатьАтрибут(ЗаписьXML, "КодНО", Выборка.КодНалоговогоОргана);
				
					ЗаписьXML.ЗаписатьНачалоЭлемента("СвПрУчЦБ");
					ЗаписатьАтрибут(ЗаписьXML, "НаимОрг", Выборка.НаименованиеОрганизации);
					ЗаписатьАтрибут(ЗаписьXML, "ИННЮЛ", Выборка.ИННОрганизации);
					ЗаписатьАтрибут(ЗаписьXML, "КПП", Выборка.КППОрганизации);
					ЗаписатьАтрибут(ЗаписьXML, "Тлф", ПолучитьТелефон(Выборка.ТелефонОрганизации));
					ЗаписьXML.ЗаписатьКонецЭлемента();
				
					ЗаписьXML.ЗаписатьНачалоЭлемента("СвИИС");
					ЗаписатьАтрибут(ЗаписьXML, "НомКорр", Выборка.НомерКорректировки);
					
						ЗаписьXML.ЗаписатьНачалоЭлемента("ИИС");
						ЗаписатьАтрибут(ЗаписьXML, "ПрИИС", ?(Выборка.ВидСообщения > 1, Выборка.ВидСообщения - 1, Выборка.ВидСообщения));
						ЗаписатьАтрибут(ЗаписьXML, "НомДог", Выборка.НомерДоговораИИС);
						ЗаписатьАтрибут(ЗаписьXML, "ДатаИИС", Выборка.ДатаИИС);
						ЗаписатьАтрибут(ЗаписьXML, "ДатаДог", Выборка.ДатаДоговораИИС);
						ЗаписьXML.ЗаписатьКонецЭлемента();
						
						ЗаписьXML.ЗаписатьНачалоЭлемента("Владелец");
						ЗаписатьАтрибут(ЗаписьXML, "ИННФЛ", Выборка.ИННВладельцаИИС);
						ЗаписатьАтрибут(ЗаписьXML, "МестоРожд", Выборка.МестоРожденияВладельцаИИС);
						ЗаписатьАтрибут(ЗаписьXML, "ДатаРожд", Выборка.ДатаРожденияВладельцаИИС);
						
							ЗаписьXML.ЗаписатьНачалоЭлемента("ФИО");
							ЗаписатьАтрибут(ЗаписьXML, "Фамилия", Выборка.ФамилияВладельцаИИС);
							ЗаписатьАтрибут(ЗаписьXML, "Имя", Выборка.ИмяВладельцаИИС);
							ЗаписатьАтрибут(ЗаписьXML, "Отчество", Выборка.ОтчествоВладельцаИИС);
							ЗаписьXML.ЗаписатьКонецЭлемента();
							
							ЗаписьXML.ЗаписатьНачалоЭлемента("УдЛичн");
							ЗаписатьАтрибут(ЗаписьXML, "КодВидДок", Выборка.КодВидаДокументаВладельцаИИС);
							ЗаписатьАтрибут(ЗаписьXML, "СерНомДок", ФорматПаспорта(Выборка.СерияНомерДокументаВладельцаИИС));
							ЗаписатьАтрибут(ЗаписьXML, "ДатаДок", Выборка.ДатаДокументаВладельцаИИС);
							ЗаписатьАтрибут(ЗаписьXML, "ВыдДок", Выборка.ОрганВыдавшийДокументВладельцаИИС);
							ЗаписьXML.ЗаписатьКонецЭлемента();
							
							ЭлементыАдреса = ПолучитьЭлементыАдресаИзФИАС(Выборка.АдресРегистрацииФИАС, Выборка.СчетДоверительногоУправления, "адрес регистрации");
							
							Если НЕ ЗначениеЗаполнено(ЭлементыАдреса.КодРегиона) Тогда
								ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен код региона в адресе счета ДУ '" + Выборка.СчетДоверительногоУправления + "'");
							КонецЕсли;
							
							ЗаписьXML.ЗаписатьНачалоЭлемента("АдрМЖРФ");
							ЗаписатьАтрибут(ЗаписьXML, "Индекс", ЭлементыАдреса.Индекс, Истина);
							ЗаписатьАтрибут(ЗаписьXML, "КодРегион", ЭлементыАдреса.КодРегиона, Истина);
							ЗаписатьАтрибут(ЗаписьXML, "Район", ЭлементыАдреса.Район, Истина);
							ЗаписатьАтрибут(ЗаписьXML, "Город", ЭлементыАдреса.Город, Истина);
							ЗаписатьАтрибут(ЗаписьXML, "НаселПункт", ЭлементыАдреса.НаселенныйПункт, Истина);
							ЗаписатьАтрибут(ЗаписьXML, "Улица", ЭлементыАдреса.Улица, Истина);
							ЗаписатьАтрибут(ЗаписьXML, "Дом", ЭлементыАдреса.Дом, Истина);
							ЗаписатьАтрибут(ЗаписьXML, "Корпус", ЭлементыАдреса.Строение, Истина);
							ЗаписатьАтрибут(ЗаписьXML, "Кварт", ЭлементыАдреса.Помещение, Истина);
							ЗаписьXML.ЗаписатьКонецЭлемента();	
						
						ЗаписьXML.ЗаписатьКонецЭлемента();
					ЗаписьXML.ЗаписатьКонецЭлемента();
				ЗаписьXML.ЗаписатьКонецЭлемента();
			ЗаписьXML.ЗаписатьКонецЭлемента();
#КонецОбласти		
		
		ИначеЕсли Объект.ВерсияФормата = "5.02" Тогда

#Область ВерсияФормата_5_02		
			ЗаписьXML.ЗаписатьНачалоЭлемента("Файл");
			ЗаписатьАтрибут(ЗаписьXML, "ИдФайл", Выборка.ИдентификаторФайла + "_" + Формат(Выборка.НомерСообщения, "ЧГ="));
			ЗаписатьАтрибут(ЗаписьXML, "ВерсПрог", Выборка.ВерсияПрограммы);
			ЗаписатьАтрибут(ЗаписьXML, "ВерсФорм", Выборка.ВерсияФормата);
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("Документ");
				ЗаписатьАтрибут(ЗаписьXML, "КНД", Выборка.КНД);
				ЗаписатьАтрибут(ЗаписьXML, "ДатаДок", Выборка.ДатаФормирования);
				ЗаписатьАтрибут(ЗаписьXML, "НомерСооб", Формат(Выборка.НомерСообщения, "ЧГ="));
				ЗаписатьАтрибут(ЗаписьXML, "КодНО", Выборка.КодНалоговогоОргана);
				
					ЗаписьXML.ЗаписатьНачалоЭлемента("СвНП");
					ЗаписатьАтрибут(ЗаписьXML, "Тлф", ПолучитьТелефон(Выборка.ТелефонОрганизации));
					
						ЗаписьXML.ЗаписатьНачалоЭлемента("НПЮЛ");
					
						ЗаписатьАтрибут(ЗаписьXML, "НаимОрг", Выборка.НаименованиеОрганизации);
						ЗаписатьАтрибут(ЗаписьXML, "ИННЮЛ", Выборка.ИННОрганизации);
						ЗаписатьАтрибут(ЗаписьXML, "КПП", Выборка.КППОрганизации);
						
						ЗаписьXML.ЗаписатьКонецЭлемента();
					
					ЗаписьXML.ЗаписатьКонецЭлемента();
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("Подписант");
					ЗаписатьАтрибут(ЗаписьXML, "ПрПодп", Строка(Объект.ПризнакПодписанта));
					
						ЗаписьXML.ЗаписатьНачалоЭлемента("ФИО");
						ЗаписатьАтрибут(ЗаписьXML, "Фамилия", Выборка.ФамилияПодписанта);
						ЗаписатьАтрибут(ЗаписьXML, "Имя", Выборка.ИмяПодписанта);
						ЗаписатьАтрибут(ЗаписьXML, "Отчество", Выборка.ОтчествоПодписанта);
						ЗаписьXML.ЗаписатьКонецЭлемента();
						
						ЗаписьXML.ЗаписатьНачалоЭлемента("СвПред");
						ЗаписатьАтрибут(ЗаписьXML, "НаимДок", "-");
						ЗаписьXML.ЗаписатьКонецЭлемента();	
					
					ЗаписьXML.ЗаписатьКонецЭлемента();
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("СообщОткрИИС");
					ЗаписатьАтрибут(ЗаписьXML, "НомКорр", Выборка.НомерКорректировки);
					
						ЗаписьXML.ЗаписатьНачалоЭлемента("СведИИС");
						ЗаписатьАтрибут(ЗаписьXML, "ПрИИС", Выборка.ВидСообщения);
						ЗаписатьАтрибут(ЗаписьXML, "НомДог", Выборка.НомерДоговораИИС);
						ЗаписатьАтрибут(ЗаписьXML, "ДатаИИС", Выборка.ДатаИИС);
						ЗаписатьАтрибут(ЗаписьXML, "ДатаДог", Выборка.ДатаДоговораИИС);

						ДатаНачалаРаскрываемыхВводов = ДобавитьМесяц(НачалоГода(Выборка.ДатаИИС), -36);
						
						Для Каждого СтрокаВводы Из ВводыПоГодам.НайтиСтроки(Новый Структура("СчетДоверительногоУправления", Выборка.СчетДоверительногоУправления)) Цикл
							
							Если СтрокаВводы.Год >= ДатаНачалаРаскрываемыхВводов Тогда
								ЗаписьXML.ЗаписатьНачалоЭлемента("СумВнесДенСр");
								ЗаписатьАтрибут(ЗаписьXML, "Год", Формат(СтрокаВводы.Год, "ДФ=yyyy"));
								ЗаписатьАтрибут(ЗаписьXML, "Сумма",	СтрокаВводы.Сумма);
								ЗаписьXML.ЗаписатьКонецЭлемента();
							КонецЕсли;
							
						КонецЦикла;	
							
						ЗаписьXML.ЗаписатьКонецЭлемента();
						
						ЗаписьXML.ЗаписатьНачалоЭлемента("Владелец");
						ЗаписатьАтрибут(ЗаписьXML, "ИННФЛ", Выборка.ИННВладельцаИИС);
						ЗаписатьАтрибут(ЗаписьXML, "ДатаРожд", Выборка.ДатаРожденияВладельцаИИС);
						
							ЗаписьXML.ЗаписатьНачалоЭлемента("ФИО");
							ЗаписатьАтрибут(ЗаписьXML, "Фамилия", Выборка.ФамилияВладельцаИИС);
							ЗаписатьАтрибут(ЗаписьXML, "Имя", Выборка.ИмяВладельцаИИС);
							ЗаписатьАтрибут(ЗаписьXML, "Отчество", Выборка.ОтчествоВладельцаИИС);
							ЗаписьXML.ЗаписатьКонецЭлемента();
							
							ЗаписьXML.ЗаписатьНачалоЭлемента("УдЛичн");
							ЗаписатьАтрибут(ЗаписьXML, "КодВидДок", Выборка.КодВидаДокументаВладельцаИИС);
							ЗаписатьАтрибут(ЗаписьXML, "СерНомДок", ФорматПаспорта(Выборка.СерияНомерДокументаВладельцаИИС));
							ЗаписьXML.ЗаписатьКонецЭлемента();
							
						ЗаписьXML.ЗаписатьКонецЭлемента();
					ЗаписьXML.ЗаписатьКонецЭлемента();
				ЗаписьXML.ЗаписатьКонецЭлемента();
			ЗаписьXML.ЗаписатьКонецЭлемента();	
#КонецОбласти		

		ИначеЕсли Объект.ВерсияФормата = "5.03" Тогда

#Область ВерсияФормата_5_03
	    	ФайлОбъектXDTO = СоздатьОбъектXDTO(СвояФабрикаXDTO, ЗначениеЗаполнено(Выборка.ИННВладельцаИИС));
			ФайлОбъектXDTO.ИдФайл = Выборка.ИдентификаторФайла + "_" + Формат(Выборка.НомерСообщения, "ЧГ="); 
			ФайлОбъектXDTO.ВерсПрог = Выборка.ВерсияПрограммы;	
            ФайлОбъектXDTO.ВерсФорм = Выборка.ВерсияФормата;
			
			ФайлОбъектXDTO.Документ.КНД	= Выборка.КНД;
			ФайлОбъектXDTO.Документ.ДатаДок	= Формат(Выборка.ДатаФормирования, "ДФ=dd.MM.yyyy");
			ФайлОбъектXDTO.Документ.НомерСооб = Формат(Выборка.НомерСообщения, "ЧГ=");
			ФайлОбъектXDTO.Документ.КодНО = Выборка.КодНалоговогоОргана;
			ФайлОбъектXDTO.Документ.НомКорр = Выборка.НомерКорректировки;
			
			ФайлОбъектXDTO.Документ.СвНП.Тлф = ПолучитьТелефон(Выборка.ТелефонОрганизации); 
			ФайлОбъектXDTO.Документ.СвНП.НПЮЛ.НаимОрг = Выборка.НаименованиеОрганизации;
			ФайлОбъектXDTO.Документ.СвНП.НПЮЛ.ИННЮЛ = Выборка.ИННОрганизации;
			ФайлОбъектXDTO.Документ.СвНП.НПЮЛ.КПП = Выборка.КППОрганизации;
			
			ФайлОбъектXDTO.Документ.Подписант.ПрПодп = Строка(Объект.ПризнакПодписанта);
			
			Если ЗначениеЗаполнено(Выборка.ФамилияПодписанта)
				Или ЗначениеЗаполнено(Выборка.ИмяПодписанта)
				Или ЗначениеЗаполнено(Выборка.ОтчествоПодписанта) Тогда
				
				ФайлОбъектXDTO.Документ.Подписант.ФИО.Фамилия = ?(ЗначениеЗаполнено(Выборка.ФамилияПодписанта), Выборка.ФамилияПодписанта, "-");
				ФайлОбъектXDTO.Документ.Подписант.ФИО.Имя = ?(ЗначениеЗаполнено(Выборка.ИмяПодписанта), Выборка.ИмяПодписанта, "-");
				ФайлОбъектXDTO.Документ.Подписант.ФИО.Отчество = ?(ЗначениеЗаполнено(Выборка.ОтчествоПодписанта), Выборка.ОтчествоПодписанта, "-");
				
			КонецЕсли;
			
			ФайлОбъектXDTO.Документ.Подписант.СвПред.НаимДок = "-";
			
			ФайлОбъектXDTO.Документ.СообщОткрИИС.Владелец.ФИО.Фамилия = Выборка.ФамилияВладельцаИИС;
			ФайлОбъектXDTO.Документ.СообщОткрИИС.Владелец.ФИО.Имя = Выборка.ИмяВладельцаИИС;
			ФайлОбъектXDTO.Документ.СообщОткрИИС.Владелец.ФИО.Отчество = Выборка.ОтчествоВладельцаИИС; 
			
			УдостоверениеЛичности = СвояФабрикаXDTO.Создать(СвояФабрикаXDTO.Тип("1C_IIS", "УдЛичнФЛТип"));
			УдостоверениеЛичности.КодВидДок = Выборка.КодВидаДокументаВладельцаИИС;
			УдостоверениеЛичности.СерНомДок = ФорматПаспорта(Выборка.СерияНомерДокументаВладельцаИИС);
			УдостоверениеЛичности.ДатаВыдач = Формат(Выборка.ДатаДокументаВладельцаИИС, "ДФ=dd.MM.yyyy");
			
			Если ЗначениеЗаполнено(Выборка.ИННВладельцаИИС) Тогда

				ФайлОбъектXDTO.Документ.СообщОткрИИС.Владелец.СведФЛ1.ИННФЛ = Выборка.ИННВладельцаИИС; 
				ФайлОбъектXDTO.Документ.СообщОткрИИС.Владелец.СведФЛ1.ДатаРожд = Формат(Выборка.ДатаРожденияВладельцаИИС, "ДФ=dd.MM.yyyy");
				ФайлОбъектXDTO.Документ.СообщОткрИИС.Владелец.СведФЛ1.УдЛичн = УдостоверениеЛичности;
				
			Иначе
				
				ФайлОбъектXDTO.Документ.СообщОткрИИС.Владелец.СведФЛ2.ДатаРожд = Формат(Выборка.ДатаРожденияВладельцаИИС, "ДФ=dd.MM.yyyy");
                ФайлОбъектXDTO.Документ.СообщОткрИИС.Владелец.СведФЛ2.УдЛичн = УдостоверениеЛичности;
				
			КонецЕсли; 
			
			ФайлОбъектXDTO.Документ.СообщОткрИИС.СведИИС.ПрИИС = Выборка.ВидСообщения;
			ФайлОбъектXDTO.Документ.СообщОткрИИС.СведИИС.НомДог = Выборка.НомерДоговораИИС;
			ФайлОбъектXDTO.Документ.СообщОткрИИС.СведИИС.ДатаДог = Формат(Выборка.ДатаДоговораИИС, "ДФ=dd.MM.yyyy");
			ФайлОбъектXDTO.Документ.СообщОткрИИС.СведИИС.ДатаИИС = Формат(Выборка.ДатаИИС, "ДФ=dd.MM.yyyy");
			
			Если Выборка.ВидСообщения >= 3 Тогда  
				//СписокXDTO. Указываем суммы вводов за год за весь период действия доовора ИИС. Если в году вводов не было - указываем год и сумму = 0.	
				ГодЗаключенияДоговора = НачалоГода(Выборка.ДатаЗаключения);
				ГодРасторжения = НачалоГода(Выборка.ДатаЗакрытия);
				
				Пока ГодЗаключенияДоговора <= ГодРасторжения Цикл 
					
					ВводДенежныхСредствXDTO = СвояФабрикаXDTO.Создать(ФайлОбъектXDTO.Документ.СообщОткрИИС.СведИИС.СумВнесДенСр.ВладеющееСвойство.Тип);
					ВводДенежныхСредствXDTO.Год = Формат(ГодЗаключенияДоговора, "ДФ=yyyy");
					
					ВводЗаГод = ВводыПоГодам.НайтиСтроки(Новый Структура("СчетДоверительногоУправления, Год", Выборка.СчетДоверительногоУправления, ГодЗаключенияДоговора));
					
					Если ВводЗаГод.Количество() = 1 Тогда
						ВводДенежныхСредствXDTO.Сумма =	ВводЗаГод[0].Сумма;
					ИначеЕсли ВводЗаГод.Количество() = 0 Тогда
						ВводДенежныхСредствXDTO.Сумма = 0;	
					КонецЕсли;
					
					ФайлОбъектXDTO.Документ.СообщОткрИИС.СведИИС.СумВнесДенСр.Добавить(ВводДенежныхСредствXDTO); 
					
					ГодЗаключенияДоговора = ДобавитьМесяц(ГодЗаключенияДоговора, 12);
					
				КонецЦикла;
				
			КонецЕсли;
		
			Если Выборка.ВидСообщения = 4 Тогда
				
				ФайлОбъектXDTO.Документ.СообщОткрИИС.ЛицоВедИИСПер.НаимОрг = Выборка.НаименованиеСтороннегоКонтрагента;
				ФайлОбъектXDTO.Документ.СообщОткрИИС.ЛицоВедИИСПер.ИННЮЛ = Выборка.ИННСтороннегоКонтрагента;
				ФайлОбъектXDTO.Документ.СообщОткрИИС.ЛицоВедИИСПер.КПП = Выборка.КППСтороннегоКонтрагента;
				
			КонецЕсли;
			
			СвояФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ФайлОбъектXDTO, "Файл");
#КонецОбласти

		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выгрузка в формате " + Объект.ВерсияФормата + " не реализована",, "ВерсияФормата");
		КонецЕсли;
		
		ЗаписьXML.Закрыть();
		
		Текст = Новый ТекстовыйДокумент;
		Текст.Прочитать(ИмяВременногоФайла, "WINDOWS-1251");
		
		ТекстXML = СтрЗаменить(Текст.ПолучитьТекст(),
			"<Файл xmlns=""1C_IIS"" xmlns:xs=""http://www.w3.org/2001/XMLSchema"" xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance""",
			"<Файл"); 
		
		СообщенияXML.Вставить(Выборка.ИдентификаторФайла + "_" + Формат(Выборка.НомерСообщения, "ЧГ=0"), ТекстXML);
		
	КонецЦикла;	
	
	Возврат СообщенияXML;
	
КонецФункции

&НаСервереБезКонтекста
Функция ФорматПаспорта(Знач СерияНомерПаспорта)
	
	СерияНомерПаспорта = СтрЗаменить(СерияНомерПаспорта, " ", "");
	
	Результат =	Сред(СерияНомерПаспорта, 1, 2) + " " +
				Сред(СерияНомерПаспорта, 3, 2) + " " +
				Сред(СерияНомерПаспорта, 5);
				
	Возврат Результат;
	
КонецФункции	

&НаСервереБезКонтекста
Процедура ЗаписатьАтрибут(ЗаписьXML, ИмяАтрибута, Значение, НеДобавлятьПустоеЗначение = Ложь)
	
	Если НеДобавлятьПустоеЗначение и НЕ ЗначениеЗаполнено(Значение) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьАтрибут(ИмяАтрибута, СериализоватьЗначение(Значение));
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЭлементыАдресаИзФИАС(АдресФИАС, СчетДоверительногоУправления, ВидАдреса)
	
	Если ТипЗнч(АдресФИАС) <> Тип("Строка") 
		ИЛИ НЕ СтрНачинаетсяС(СокрЛ(АдресФИАС), "<") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Некорректный формат адреса '" + ВидАдреса + "' в счете ДУ '" + СчетДоверительногоУправления + "'");
		Возврат Новый Структура("Индекс,КодРегиона,Район,Город,НаселенныйПункт,Улица,Дом,Строение,Помещение");
	КонецЕсли;
	
	Возврат РаботаСКонтактнойИнформациейКлиентСервер.АдресФИАСВСтруктуру(АдресФИАС);

КонецФункции

&НаСервереБезКонтекста
Функция СоздатьОбъектXDTO(ФабрикаXDTO, ЕстьИНН)
	
	ФайлТип = ФабрикаXDTO.Тип("1C_IIS", "Файл");
	ФайлXDTO = ФабрикаXDTO.Создать(ФайлТип);
	
	ДокументТип = ФайлТип.Свойства.Получить("Документ").Тип;
	ФайлXDTO.Документ = ФабрикаXDTO.Создать(ДокументТип);
	
	СвНПТип = ДокументТип.Свойства.Получить("СвНП").Тип;
	ФайлXDTO.Документ.СвНП = ФабрикаXDTO.Создать(СвНПТип);
	
	НПЮЛТип = СвНПТип.Свойства.Получить("НПЮЛ").Тип;
	ФайлXDTO.Документ.СвНП.НПЮЛ = ФабрикаXDTO.Создать(НПЮЛТип);
	
	ПодписантТип = ДокументТип.Свойства.Получить("Подписант").Тип; 
	ФайлXDTO.Документ.Подписант = ФабрикаXDTO.Создать(ПодписантТип);
	
	ФайлXDTO.Документ.Подписант.ФИО = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("1C_IIS", "ФИОТип"));
	
	СвПредТип = ПодписантТип.Свойства.Получить("СвПред").Тип; 
	ФайлXDTO.Документ.Подписант.СвПред = ФабрикаXDTO.Создать(СвПредТип);
	
	СообщОткрИИСТип = ДокументТип.Свойства.Получить("СообщОткрИИС").Тип;
	ФайлXDTO.Документ.СообщОткрИИС = ФабрикаXDTO.Создать(СообщОткрИИСТип);
	
	ВладелецТип = СообщОткрИИСТип.Свойства.Получить("Владелец").Тип;
	
	ФайлXDTO.Документ.СообщОткрИИС.Владелец = ФабрикаXDTO.Создать(ВладелецТип); 
	ФайлXDTO.Документ.СообщОткрИИС.Владелец.ФИО = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("1C_IIS", "ФИОТип")); 
	
	Если ЕстьИНН Тогда
		
		СведФЛ1Тип = ВладелецТип.Свойства.Получить("СведФЛ1").Тип; 
		ФайлXDTO.Документ.СообщОткрИИС.Владелец.СведФЛ1	= ФабрикаXDTO.Создать(СведФЛ1Тип);
	
	Иначе
		
		СведФЛ2Тип = ВладелецТип.Свойства.Получить("СведФЛ2").Тип;
		ФайлXDTO.Документ.СообщОткрИИС.Владелец.СведФЛ2 = ФабрикаXDTO.Создать(СведФЛ2Тип);
		
	КонецЕсли;
	
	СведИИСТип = СообщОткрИИСТип.Свойства.Получить("СведИИС").Тип;
	ФайлXDTO.Документ.СообщОткрИИС.СведИИС = ФабрикаXDTO.Создать(СведИИСТип); 
	
	ЛицоВедИИСПерТип = СообщОткрИИСТип.Свойства.Получить("ЛицоВедИИСПер").Тип; 
	ФайлXDTO.Документ.СообщОткрИИС.ЛицоВедИИСПер = ФабрикаXDTO.Создать(ЛицоВедИИСПерТип);
	
	Возврат ФайлXDTO;
	
КонецФункции

&НаСервереБезКонтекста
Функция СериализоватьЗначение(Значение)
	
	Если  ТипЗнч(Значение) = Тип("Дата") Тогда
		Возврат Формат(Значение, "ДФ=dd.MM.yyyy");
	ИначеЕсли Значение = Неопределено Тогда
		Возврат "";
	Иначе
		Возврат СериализаторXDTO.XMLСтрока(Значение);
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТелефон(Значение)
	
	Телефон = "";
	
	Цифры = "1234567890";
	ДопустимыеСимволы = "1234567890()- ";
	
	Для НомерСимвола = 1 По СтрДлина(Значение) Цикл
		Если Найти(ДопустимыеСимволы, Сред(Значение, НомерСимвола, 1)) = 0 Тогда
			Прервать;
		КонецЕсли;
		
		Если Найти(Цифры, Сред(Значение, НомерСимвола, 1)) > 0 Тогда
			Телефон = Телефон + Сред(Значение, НомерСимвола, 1);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Телефон;
	
КонецФункции

&НаСервере
Функция ПовторнаяВыгрузка()
	
	Отказ = Ложь;
	
	Для Каждого СтрокаСообщения Из Объект.СообщенияОбОткрытииЗакрытииИИС Цикл
		Если СтрокаСообщения.Выгружать И ЗначениеЗаполнено(СтрокаСообщения.Номер) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Повторная выгрузка сообщения: " + СтрокаСообщения.Документ + ", строка " + СтрокаСообщения.НомерСтроки,,,, Отказ);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Отказ;
	
КонецФункции

&НаСервере
Функция ПолучитьОтчетОповещения()
	
	Результат = Новый ТабличныйДокумент;
	РеквизитФормыВЗначение("Объект").СформироватьОтчет(Результат);
	
	Если Результат.ВысотаТаблицы > 0 Тогда
		Возврат Результат;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьТаблицуСообщений(Команда)
	
	ОбновитьТаблицуСообщенийНаСервере(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьФайлы(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.КаталогДанных) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран каталог данных!");
		Возврат;
	Иначе
		Файл = Новый Файл(Объект.КаталогДанных);
		
		Если НЕ Файл.Существует() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Указанный каталог данных не существует или недоступен!");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.СообщенияОбОткрытииЗакрытииИИС.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет сообщений для выгрузки!");
		Возврат;
	КонецЕсли;
	
	Если ПовторнаяВыгрузка() Тогда
		Ответ = Вопрос("Сообщениям уже присвоен номер, возможно, они выгружаются повтороно. Продолжить?", РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет);
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ЗарегистрироватьНомераСообщенийНаСервере();
	
	МассивСохраняемыхФайлов = Новый Массив;
	МассивСуществующихФайлов = Новый Массив;
	
	СообщенияXML = ПолучитьСообщенияXML();	
	
	Для Каждого СообщениеXML Из СообщенияXML Цикл
		
		СохраняемыйФайл = Новый Структура("Текст, ИмяФайла, Сохранить");
		
		СохраняемыйФайл.Вставить("Текст", Новый ТекстовыйДокумент);
		СохраняемыйФайл.Текст.ДобавитьСтроку(СообщениеXML.Значение);
		
		СохраняемыйФайл.Вставить("ИмяФайла", Объект.КаталогДанных + "\" + СообщениеXML.Ключ + ".xml");
		
		ПроверяемыйФайл = Новый Файл(СохраняемыйФайл.ИмяФайла);
		
		Если ПроверяемыйФайл.Существует() Тогда
			МассивСуществующихФайлов.Добавить(СохраняемыйФайл.ИмяФайла);
			СохраняемыйФайл.Вставить("Существует", Истина);
		Иначе	
			СохраняемыйФайл.Вставить("Существует", Ложь);
		КонецЕсли;
		
		МассивСохраняемыхФайлов.Добавить(СохраняемыйФайл);
		
	КонецЦикла;	
	
	ПерезаписыватьСуществующиеФайлы = Ложь;
	
	Если МассивСуществующихФайлов.Количество() Тогда
		ПерезаписыватьСуществующиеФайлы = (Вопрос("Перезаписать уже сущестсвующие файлы?" + Символы.ПС + СтрСоединить(МассивСуществующихФайлов, Символы.ПС), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да); 
	КонецЕсли;
	
	Для Каждого СохраняемыйФайл Из МассивСохраняемыхФайлов Цикл
		Если НЕ СохраняемыйФайл.Существует 
		 ИЛИ СохраняемыйФайл.Существует И ПерезаписыватьСуществующиеФайлы Тогда
		 
		 	Попытка
				СохраняемыйФайл.Текст.Записать(СохраняемыйФайл.ИмяФайла, "WINDOWS-1251");
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					"Выгрузка прервана!
					|При записи файла '" + СохраняемыйФайл.ИмяФайла + "' произошла ошибка:
					|" + ОписаниеОшибки());
				Возврат;
			КонецПопытки;
		
		КонецЕсли;
	КонецЦикла;
	
	Если СообщенияXML.Количество() > 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Файлы сформированы!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетОповещения(Команда)
	
	Результат = ПолучитьОтчетОповещения();
	
	Если Результат <> Неопределено Тогда
		Результат.Показать("Отчёт оповещения на " + Формат(ТекущаяДата(), "ДФ=dd.MM.yy"));	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КаталогДанныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
	Диалог.Каталог            = Объект.КаталогДанных; 
	Диалог.МножественныйВыбор = Ложь; 
	Диалог.Заголовок          = "Выберите каталог"; 
	
	Если Диалог.Выбрать() Тогда 
		Объект.КаталогДанных = Диалог.Каталог;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогДанныхОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(Объект.КаталогДанных + "\");
	
КонецПроцедуры

&НаКлиенте
Процедура СообщенияОбОткрытииЗакрытииИИСВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.СообщенияОбОткрытииЗакрытииИИСПредупреждение Тогда
		ТекущиеДанные = Элементы.СообщенияОбОткрытииЗакрытииИИС.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			Если ТекущиеДанные.Документ <> ТекущиеДанные.Регистратор Тогда
				Предупреждение("Номер зарегистрирован другим документом!" + Символы.ПС + ТекущиеДанные.Регистратор);
			КонецЕсли;
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СообщенияОбОткрытииЗакрытииИИСВыгружатьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СообщенияОбОткрытииЗакрытииИИС.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено 
	   И ТекущиеДанные.Выгружать
	   И ТекущиеДанные.ВидСообщения >= 3 Тогда
	   
	   ДатаВывода = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Регистратор, "Дата");
	   
	   Если ДатаВывода < Объект.Период.ДатаНачала ИЛИ ДатаВывода > Объект.Период.ДатаОкончания Тогда
		   
		   ТекстПредупреждения = 
				СтрШаблон("Дата вывода %1 не попадает в указанный период %2-%3. Выгрузка запрещена.",
					Формат(ДатаВывода, "ДФ=dd.MM.yyyy"),
					Формат(Объект.Период.ДатаНачала, "ДФ=dd.MM.yyyy"),
					Формат(Объект.Период.ДатаОкончания, "ДФ=dd.MM.yyyy"));
			
			ПоказатьПредупреждение(, ТекстПредупреждения); 
			ТекущиеДанные.Выгружать = Ложь;

		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Если Объект.СообщенияОбОткрытииЗакрытииИИС.Количество() > 0
		И Вопрос("Таблица сообщений будет обновлена. Продолжить?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда
		Возврат;	
	КонецЕсли;
	
	ОбновитьТаблицуСообщенийНаСервере(Истина);

КонецПроцедуры
